[
  {
    "id": "18626_8960",
    "session_id": "W485",
    "session_type": "Session",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "AI 101, Convolutional Neural Network (CNN) for MNIST",
    "desc": "Whether its facial recognition or self-driving cars, CNNs are used everywhere. Join this hands-on workshop to learn how to implement a simple CNN for a Modified National Institute of Standards and Technology database (MNIST). Using an MNIST dataset (70,000 pictures of hand-written digits) you’ll learn how to build a simple CNN and train it to solve a real problem with Keras (a deep learning library for Python.) On completion, you’ll be able to predict a digit, given a picture of hand-written digits with 99% accuracy.",
    "presenter": "Hana Malha",
    "role": "Developer",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "W480",
    "session_type": "Session",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack: API 101, API Basics and the Value They Provide",
    "desc": "You may know that application programming interfaces (APIs) allow applications to talk to other apps, but have you ever used them? Today, APIs are available for most products and solutions. You can take advantage of them when writing automation scripts, integrating code or defining infrastructure-as-code, as long as you understand the mechanisms used to consume an API. In this hands-on workshop, we’ll review all the jargon and technology used by REST APIs and show you how to place your first API call against a publicly available API.",
    "presenter": "Didier Lalli",
    "role": "Technology Strategist",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "W486",
    "session_type": "Workshop",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack: Automate Apps With the HPE Container Platform",
    "desc": "IT administrators are frequently challenged to stand up hardware and software environments. These requests can be time-consuming and confusing for non-technical teams to deploy. By implementing the HPE Container Platform with its easy-to-use APIs, new clusters and software applications can be created automatically with specified resources. Join this hands-on workshop to learn how the HPE Container Platform APIs make it easier to configure apps and compute resources, along with how to pull detailed usage reports for chargeback/showback.",
    "presenter": "Chris Crawford",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "W479",
    "session_type": "Workshop",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack: Intro to the HPE Container Platform REST API",
    "desc": "Calling all developers, data analysts and IT architects. Learn how to interact with the HPE Container Platform programmatically through its REST API. In this hands-on workshop, you’ll learn how to perform authentication, deploy distributed multi-mode applications for AI/ML and data analytics and interpret/respond to REST API calls. We’ll walk you through, step by step, and, by the end of the session, you’ll be deploying a TensorFlow application framework and other simple applications. No previous programming experience required.",
    "presenter": "Denis Choukroun",
    "role": "Cloud Solution Architect",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "IHS1",
    "session_type": "Workshop",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack: Redfish API Use With PowerShell Python and Bash/cURL",
    "desc": "DMTF’s Redfish is a standard designed to deliver simple and secure management for converged, hybrid IT and the Software-Defined Data Center (SDDC). Today it is rapidly replacing proprietary protocols. In this hands-on workshop, you’ll get to explore the Redfish tree of an OpenBMC and HPE iLO 5 to understand its basic structure, and learn how to modify resources and perform simple actions. You’ll interact with the HTTP/JSON-based standard using your favorite language, whether it’s PowerShell, Python or Bash/cURL. Beginners and experts welcome.",
    "presenter": "Francois Donze",
    "role": "Technical Consultant",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "W481",
    "session_type": "Workshop",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack: Use Aruba API Yourself",
    "desc": "Get your automation game on with Aruba APIs in this Hands-on Lab session covering Aruba’s wired and wireless portfolio. In this workshop, you’ll learn to manage, configure and automate Aruba products using their REST APIs, and move away from slow and error-prone CLI (command line interface) work. We’re offering a collection of labs tailored to varying skill levels, from coding new-comers to hardcore Pythonistas and everyone in-between. No experience required.s",
    "presenter": "Joe Neville",
    "role": "TBD",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "T491",
    "session_type": "Session",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack Session: What Data Scientists Can Learn From Software Developers",
    "desc": "Developers have been building best practices since the first programs were written, culminating in the DevOps movement. There is plenty to learn about building software on which critical workloads depend (e.g., building resilience or simply accelerating testing and experimentation). We will look at the parallels between the two disciplines, highlighting areas where one can build upon the work of the other and how HPE Container Platform makes that process simpler and more accessible with MLOps.",
    "presenter": "Glyn Bowden",
    "role": "Chief Architect, AI & Data Science",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  },
  {
    "id": "18626_8960",
    "session_id": "T491",
    "session_type": "Session",
    "avatar": "//s.gravatar.com/avatar/b7fb138d53ba0f573212ccce38a7c43b?s=80",
    "title": "Hack Shack Session: What Data Scientists Can Learn From Software Developers",
    "desc": "Developers have been building best practices since the first programs were written, culminating in the DevOps movement. There is plenty to learn about building software on which critical workloads depend (e.g., building resilience or simply accelerating testing and experimentation). We will look at the parallels between the two disciplines, highlighting areas where one can build upon the work of the other and how HPE Container Platform makes that process simpler and more accessible with MLOps.",
    "presenter": "Nanda Vijaydev",
    "role": "Distinguised Technologist, Lead Data Scientist",
    "week": "1",
    "link": "https://www.hpe.com/us/en/discover.html?&chatsrc=ot-en&jumpid=ps_7sr3y6pvbc_aid-520023673"
  }
]
